🚀&nbsp; env0 had composed a PR Plan for environment [Redash with github integration-13362](https://app.env0.com/p/QDK4IMekJVUczZZsfzNsK/environments/2d127fd6-ae4b-4135-b5a5-bc8ca5a8f80d):

```
Plan: 1 to add, 1 to change, 1 to destroy.
```

<details>

<summary>Plan Details</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_eip.redash-elastic-ip will be updated in-place
  ~ resource "aws_eip" "redash-elastic-ip" {

        association_id       = "eipassoc-0d0e58f216d9823ce"
        domain               = "vpc"
        id                   = "eipalloc-08c6e34a8462aab1a"
      ~ instance             = "i-0f071f4d2fc542a9e" -> (known after apply)
        network_border_group = "us-east-1"
        network_interface    = "eni-0dedf77743b68d5aa"

        private_dns          = "ip-10-0-0-79.ec2.internal"
        private_ip           = "10.0.0.79"
        public_dns           = "ec2-52-70-151-92.compute-1.amazonaws.com"
        public_ip            = "52.70.151.92"
        public_ipv4_pool     = "amazon"
        tags                 = {
            "env0_environment_id" = "2d127fd6-ae4b-4135-b5a5-bc8ca5a8f80d"
            "env0_project_id"     = "qdk4imekjvuczzzsfznsk"
        }

        vpc                  = true
    }


  # aws_instance.redash-instance must be replaced
-/+ resource "aws_instance" "redash-instance" {

      ~ ami                          = "ami-0c654c3ab463d22f6" -> "ami-0d915a031cabac0e0" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:326535729404:instance/i-0f071f4d2fc542a9e" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)

      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 1 -> (known after apply)
      - disable_api_termination      = false -> null

      - ebs_optimized                = false -> null
        get_password_data            = false
      - hibernation                  = false -> null
      + host_id                      = (known after apply)

      ~ id                           = "i-0f071f4d2fc542a9e" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
        instance_type                = "t2.small"
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
        key_name                     = "redash-key-fb2d4c64-0952-0ec4-fa47-195ca7c0689e"

      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0dedf77743b68d5aa" -> (known after apply)
      ~ private_dns                  = "ip-10-0-0-79.ec2.internal" -> (known after apply)

      ~ private_ip                   = "10.0.0.79" -> (known after apply)
      ~ public_dns                   = "ec2-52-70-151-92.compute-1.amazonaws.com" -> (known after apply)

      ~ public_ip                    = "52.70.151.92" -> (known after apply)

      ~ secondary_private_ips        = [] -> (known after apply)

      ~ security_groups              = [] -> (known after apply)
        source_dest_check            = true

        subnet_id                    = "subnet-009004939952d31b0"
        tags                         = {

            "CreatedBy"           = "env0"
            "Env0"                = "fb2d4c64-0952-0ec4-fa47-195ca7c0689e"

            "Name"                = "redash-instance"

            "env0_environment_id" = "2d127fd6-ae4b-4135-b5a5-bc8ca5a8f80d"
            "env0_project_id"     = "qdk4imekjvuczzzsfznsk"
        }
      ~ tenancy                      = "default" -> (known after apply)

      ~ volume_tags                  = {} -> (known after apply)
        vpc_security_group_ids       = [
            "sg-0b4a5ad360a88d892",
        ]

      - credit_specification {

          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)

          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)

          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)

          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {

          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)

          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)

          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }

      + network_interface {

          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)

          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)

          + kms_key_id            = (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0ae18f8efac15181d" -> (known after apply)

          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.


```

</details>


[Full Plan Logs on env0](https://app.env0.com/p/QDK4IMekJVUczZZsfzNsK/environments/2d127fd6-ae4b-4135-b5a5-bc8ca5a8f80d/deployments/296de69b-e7bb-4555-aa54-185493c83677)
  